Autodesk.Revit.DB.PointCloudFoundStatus
Enumerated type representing the possible states related to searching for a point cloud file.
Since:
2012

Autodesk.Revit.DB.PointCloudFoundStatus.FoundOK
File-based Point Cloud has been located and can be loaded.

Autodesk.Revit.DB.PointCloudFoundStatus.NotFound
File-based Point Cloud cannot be located and hence can't be loaded.

Autodesk.Revit.DB.PointCloudFoundStatus.Unknown
Initial state.  Loading of the Point Cloud hasn't been attempted.